__SQL Quick Notes__

- SQL is a command langualge
- SQL is a declarative language.
- Top SQL DB's are  --> MS SQL Server, MySQL, Oracle, DB2
- CRUD oepration : Create, Read, Update and Delete
- Primary Key and Unique Key are Entity integrity constraints
- Aliases : It is a temporary name assigned to the table or column for the purpose of a particular SQL query.
- VIEW :  a virtual table based on the result-set of an SQL statement. 
- 7 constraints: primary key, foreign key, not_null, default, index, unique and check
- 3 indexes : clustered, non-clustered and unique
- 2 variables : local and global
- 2 levels of constraints : column level and table level
- enum value - its a custom data type (set of values that is acceptable) in that field
- Oracle NVL() do the same thing as COALESCE() does.

__Optimiztion Principle__

- Avoid using 'Like' queries where possible try to get the value using an equality first
- Don't use functions in the where clause. Because the query engine must execute the function for every single row.

__TO RESOLVE__

- Windows functions and their practical use (partition by)
- use of DISTINCT w.r.t functions
- Triggers
- What is a database cursor?
- What is a database transaction? A database lock?
- How do you use the NULLIF function?
- What is the difference between the RANK() and the DENSE_RANK() functions?
- What is a key? A candidate key? A primary key? An alternate key? A foreign key?
- What are the data types available and when to use which ones?
- JOINs, ANSI-89 and ANSI-92 syntax
- NULL handling: COALESCE & Native NULL handling
- Subqueries: IN, EXISTS, and inline views
- Subqueries: Correlated
- WITH syntax: Subquery Factoring/CTE
- Discuss NULL values and related issues.
- ISNULL/COALESCE for calculation purposes

##  SQL Joins

American National Standards Institute (ANSI) SQL specifies 5 types of join clauses

1. INNER JOIN
2. LEFT JOIN (LEFT OUTER JOIN)
3. RIGHT JOIN (RIGHT OUTER JOIN)
4. FULL JOIN (FULL OUTER JOIN or effect of both LEFT JOIN and RIGHT JOIN)
5. CROSS JOIN

### Difference between SQL row_number(), rank() and dense_rank() functions

ROW_NUMBER(): generates a new row number for every row, regardless of duplicates within a partition.

RANK(): This one generates a new row number for every distinct row, leaving gaps between groups of duplicates within a partition.

DENSE_RANK(): This one generates a new row number for every distinct row, leaving no gaps between groups of duplicates within a partition.

## Given the following tables, explain the outputs?

```mysql
SELECT * FROM runners;
```


| id | name         |
|----| -------------|
|  1 | John Doe     |
|  2 | Jane Doe     |
|  3 | Alice Jones  |
|  4 | Bobby Louis  |
|  5 | Lisa Romero  |

```mysql
SELECT * FROM races;
```

| id | event          | winner_id |
|----|----------------|-----------|
|  1 | 100 meter dash |  2        |
|  2 | 500 meter dash |  3        |
|  3 | cross-country  |  2        |
|  4 | triathalon     |  NULL     |


```mysql
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races)
```
If the set being evaluated by the SQL NOT IN condition contains null, then the outer query here will return an empty set, even if there are many runner ids that match winner_ids in the races table.


```mysql
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races WHERE winner_id IS NOT null)
```

# Top N items per group

```mysql

select * from (
    select country, 
           city,
           population, 
           row_number() over (partition by country order by population desc) as country_rank 
    from cities) ranks
where country_rank <= 2;

```

__What is Full Outer Join With Exclusion?__

It gives all NOT common records of both the tables, that means it is actually inverse of the inner join and many often call it Not Inner Join.

```mysql

select * from T1
full outer join T2
        on T1.col1 = T2.col1
 where T1.col1 is null or T2.col1 is null
 
 ```

__Q Do SQL joins with out using Join?__

Yes, it is possible to join two tables without using the join keyword. Here is how you can do it.

```mysql
SELECT *
FROM [Sales].[Invoices],[Purchasing].[PurchaseOrders]
```

The result of the above query will be cross join between the two tables which are mentioned in the query. Not only that you can also put multiple tables (more than 2)  in the FROM clause with a comma between them and they will be all cross joined. Cross join is also known as cartesian join.

If we specify the WHERE condition to the join which we just have seen, we can also convert the same cross join to inner join as well. Here is how you can join two tables which have a relation between them.

```mysql
SELECT *
FROM TableA a, TableB b
WHERE a.condition1 = b.condition2
```

Once again, please note that while the syntax above works great and still produces similar efficient results for Inner Join and Cross Join, it is not preferred ANSI standard syntax. It is suggested that for clarity of the code and to follow the standard, it is a good idea to use the explicit JOIN Keywords.

__Q What are constraints in SQL?__

Constraints are database schema definition for enforcing data integrity. They define certain properties that data in a database must comply with.

It can be applied for single or multiple fields in an SQL table during creation of table or after creationg using the ALTER TABLE command. The constraints are:

- PRIMARY KEY - Uniquely identifies each record in a table.
- FOREIGN KEY - Ensures referential integrity for a record in another table.
- UNIQUE - Ensures unique values to be inserted into the field.
- INDEX - Indexes a field providing faster retrieval of records.
- NOT NULL - Restricts NULL value from being inserted into a column.
- CHECK - Verifies that all values in a field satisfy a condition.
- DEFAULT - Automatically assigns a default value if no value has been specified for the field.

__Q Explain the meaning of ‘index’?__

Indexes help retrieve information from the database faster and with higher efficiency. An index refers to a performance tuning method of allowing faster retrieval of records from the table. An index creates an entry for each value and hence it will be faster to retrieve data.

- Clustered – reorders the table and searches for information with the use of key values
- Non-clustered – maintains the order of the table
- Unique – forbids fields to have duplicated values

Moreover, a table can have multiple non-cluster indexes, but only 1 single clustered one.

__Q What is the Difference between Primary Key and Unique key?__

1. Behavior: Primary Key is used to identify a row (record) in a table whereas Unique-key is to prevent duplicate values in a column.

2. Indexing: By default Sql-engine creates Clustered Index on primary-key if not exists and Non-Clustered Index on Unique-key.

3. Nullability: Primary key does not include Null values whereas Unique-key can.

4. Existence: A table can have at most one primary key but can have multiple Unique-key.

5. Modifiability: You can’t change or delete primary values but Unique-key values can.

**a primary key can be referenced as foreign key into other tables.

__Q What are the differences between a clustered and a non-clustered index?__

__Clustered Index__

- A clustered index determine the physical order of DATA in a table.For this reason a table have only 1 clustered index.
- Clustered indexes are stored physically on the table. This means they are the fastest and you can only have one clustered index per table.
- A clustered index is essentially a sorted copy of the data in the indexed columns.
- A table cannot have more than one clustered index, although it can have a single composite clustered index (ie the table is physically ordered by eg Surname, Firstname, DOB).
- Clustered indexes work great for ranges (e.g. select * from my_table where my_key between @min and @max)
- Writing to a table with a clustered index can be slower as there is a need to rearrange the data.
- By default, the primary key on a SQL Server table is also used as the clustering key - but that doesn't need to be that way!


__Non Clustered Index__

- Unclustered means it's "only" a logical order.
- Non-clustered indexes are stored separately, and you can have as many as you want.
- Can be used many times per table
- Quicker for insert and update operations than a clustered index
- when table is non-clustered data files are unordered and it uses Heap data structure.

__Q Are NULL values equal to a zero ?__

No, because a “zero” has a numerical manner and NULL represent the absence of a character. This happens when the character is unknown or unavailable. Additionally, NULL shouldn’t be confused with blank space because data record without any value assigned is not the same as a plain blank space, with no data records attached.

__Q What is the difference between primary, unique and foreign key constraints, and indexes?__

Primary key allows each row in a table to be uniquely identified and ensures that no duplicate rows exist and no null values are entered. Primary key mainly prevent duplication and shows the uniqueness of columns Foreign key mainly shows relationship on two tables

Unique key constraint is used to prevent the duplication of key values within the rows of a table and allow null values. (In oracle one null is not equal to another null).

__Primary Key__
- Usually Primary Key is used to index the data inside the table.
- identify uniquely every row it can not be null. it can not be a duplicate.
- Can't have a NULL value.
- Each table can have only one primary key.
- By default, Primary key is clustered index and data in the database table is physically organized in the sequence of clustered index.
- PRIMARY acts exactly like a UNIQUE index, except that it is always named 'PRIMARY'
- Primary key can be related with another table's as a Foreign Key.
- We can generated ID automatically with the help of Auto Increment field. Primary key supports Auto Increment value.

__Unique Key__
- Unique Constraint may have a NULL value.
- Each table can have more than one Unique Constraint.
- By default, Unique key is a unique non-clustered index.
- Unique Constraint can not be related with another table's as a Foreign Key.
- Unique Constraint doesn't supports Auto Increment value.

__Foreign Key__
- create relationship between two tables. can be null. can be a duplicate
- Foreign key is a field in the table that is primary key in another table.
- Foreign key can accept multiple null value.
- Foreign key do not automatically create an index, clustered or non-clustered. You can manually create an index on foreign key.
- We can have more than one foreign key in a table.

__Q What are the TRUNCATE, DELETE and DROP statements?__

DELETE statement is used to delete rows from a table.

_DELETE FROM Candidates WHERE CandidateId > 1000;_

TRUNCATE command is used to delete all the rows from the table and free the space containing the table.

_TRUNCATE TABLE Candidates;_

DROP command is used to remove an object from the database. If you drop a table, all the rows in the table is deleted and the table structure is removed from the database.

_DROP TABLE Candidates;_

__Drop vs Truncate__

DROP TABLE - deletes the table from the database. 
TRUNCATE TABLE - empties it, but leaves the structure for future data.

If a table is dropped, all things associated with the tables are dropped as well. This includes - the relationships defined on the table with other tables, the integrity checks and constraints, access privileges and other grants that the table has. To create and use the table again in its original form, all these relations, checks, constraints, privileges and relationships need to be redefined. However, if a table is truncated, none of the above problems exist and the table retains its original structure.

__Delete vs Truncate__

The TRUNCATE command is used to delete all the rows from the table and free the space containing the table.
The DELETE command deletes only the rows from the table based on the condition given in the where clause or deletes all the rows from the table if no condition is specified. But it does not free the space containing the table.

__Q What are some of the differences between using recursion to solve a problem versus using iteration? Which one is faster? Which one uses more memory?__

The fact is that recursion is rarely the most efficient approach to solving a problem, and iteration is almost always more efficient. This is because there is usually more overhead associated with making recursive calls due to the fact that the call stack is so heavily used during recursion (for a refresher on this, read here: Recursion tutorial). This means that many computer programming languages will spend more time maintaining the call stack then they will actually performing the necessary calculations.

__Q Having vs Where?__

Aggregates cannot be used in a WHERE clause; they are used only inside HAVING.

HAVING allows a user to perform conditional tests on aggregate values. It is often used in combination with GROUP BY. With HAVING, you can include or exclude groups based on the aggregate value for that group.

A WHERE clause is useful in both grouped and ungrouped queries, while a HAVING clause should appear only immediately after the GROUP BY clause in a grouped query.

Similar to the WHERE clause, the HAVING clause requires that the column names that appear in the clause must also appear as column names in the GROUP BY clause.

Similar to the WHERE clause, it is ok for column names not appearing in the GROUP BY clause to appear as arguments to aggregate functions.


g.g. Find the average salary of for each department that has either more than 1 employee or starts with a “To”:

```mysql
SELECT Dept, AVG(Salary) as avg_sal
FROM Employee
GROUP BY Dept
HAVING COUNT(Name) > 1 OR Dept LIKE “To”
```

__Q What are Aggregate and Scalar functions?__


An aggregate function performs operations on a collection of values to return a single scalar value. Aggregate functions are often used with the GROUP BY and HAVING clauses of the SELECT statement. 

- AVG() - Calculates the mean of a collection of values.
- COUNT() - Counts the total number of records in a specific table or view.
- MIN() - Calculates the minimum of a collection of values.
- MAX() - Calculates the maximum of a collection of values.
- SUM() - Calculates the sum of a collection of values.


__Note__: All aggregate functions ignore NULL values except COUNT function.

__Scaler Function__

A scalar function returns a single value based on the input value. Following are the widely used SQL scalar functions:

- LEN() - Calculates the total length of the given field (column).
- UCASE() - Converts a collection of string values to uppercase characters.
- LCASE() - Converts a collection of string values to lowercase characters.
- MID() - Extracts substrings from a collection of string values in a table.
- CONCAT() - Concatenates two or more strings.
- ROUND() - Calculates the round off integer value for a numeric field (or decimal point values).
- NOW() - Returns the current data & time.

__Q What is the difference between CHAR and VARCHAR2 datatype in SQL?__

Both Char and Varchar2 are used for characters datatype but varchar2 is used for character strings of variable length whereas Char is used for strings of fixed length. For example, char(10) can only store 10 characters and will not be able to store a string of any other length whereas varchar2(10) can store any length i.e 6,8,2 in this variable.

__Q What is CLAUSE in SQL?__

SQL clause helps to limit the result set by providing a condition to the query. A clause helps to filter the rows from the entire set of records.

For example – WHERE, HAVING clause.

HAVING clause can be used only with SELECT statement. It is usually used in a GROUP BY clause and whenever GROUP BY is not used, HAVING behaves like a WHERE clause.

Having Clause is only used with the GROUP BY function in a query whereas WHERE Clause is applied to each row before they are a part of the GROUP BY function in a query.

__Q What is CTE?__

A CTE or common table expression is an expression which contains temporary result set which is defined in a SQL statement.

__Q Can Primary key is a Foreign Key on the same table?__

Yes

__Q What is the use of the DROP option in the ALTER TABLE command?__

It is used to drop constraints specified on the table.

__Q What is a Cartesian product?__

A Cartesian product is the result of an unrestricted join of two or more tables. The result set of a three table Cartesian product will have x * y * z number of rows where x, y, z correspond to the number of rows in each table involved in the join.

__Q What is the difference between Delete and Truncate command in SQL?__

Delete command and truncate command both will delete the data, however the truncate command can not be rolled back as delete can be. TRUNCATE is a DDL command whereas DELETE is a DML command. The delete command can be used for selected records using the where clause but with the truncate command we have to loose data. DELETE statement is a logged operation and hence takes more time then truncate.

__Q Which function is used to find the largest integer less than or equal to a specific value?__

FLOOR

__Q What is sql identity?__

SQL IDENTITY (Property) creates an identity column in a table.

Syntax:

IDENTITY [ ( seed , increment ) ]

Example 1 of IDENTITY (Property)

```mysql
CREATE TABLE EMP
(
id_number int IDENTITY(1,1),
nick_name varchar (20)
)
```

__Q Difference between Union & Union All__?

The union and union all operators allow you to combine multiple data sets. The difference between the two is that union sorts the combined set and removes duplicates while union all does not.

Union all is faster than union, union's duplicate elimination requires a sorting operation, which takes time.

__Q What is the difference between the outputs of the following two queries?__

Statement 1:
```mysql
SELECT COUNT (*), SUM (comm)
FROM hr.employees;
```
Statement 2:
```mysql
SELECT COUNT (comm), SUM (comm)
FROM hr.employees;
```
The COUNT (*) will count all rows in the table.

The COUNT (comm) will count only the number commission values that appear in the table. If there are any rows with a NULL commission, statement 2 will not count them.

Restriction on SELECT Lists with Aggregation

If any aggregation is used, then each element of a SELECT clause must either be aggregated or appear in a group-by clause. i.e. as a rule, when using GROUP BY and aggregate functions, any items in the SELECT list not used as an argument to an aggregate function must be included in the GROUP BY clause.

Group by cannot use column aliasing. A GROUP BY clause must contain the column or expressions on which to perform the grouping operation. For example:

Incorrect way:
```mysql
Select deptno as department, count (*) as cnt
From emp
Group by department
```
Correct way is:
```mysql
Select deptno as department, count (*) as cnt
From emp
Group by deptno
```

__Q find rows 4 and 5 using left join or right join?__

table T1

| a   |
| ----|
| 1   |
| 2   |
| 3   |

table T2

| b   |
| ----|
| 1   |
| 2   |
| 3   |
| 4   |
| 5   |

```mysql
select * from table T2
left join T1
on T1.a = T2.b
where T1.a is null
```

__Q How to find count of duplicate rows?__

```mysql
Select emp, count(emp) 
from employee
Group by emp
Having count(emp)>1
Order by count (emp) desc;
```

__Q How to find duplicate records with the number they are duplicated?__

```mysql
SELECT Id, count (*) as num_records
from table  
group by id  
having count (*) > 1
```

__Q How to fetch common records from two different tables which has not any joining condition?__
```mysql
Select * from Table1
Intersect
Select * from Table2
```

__Q How to Show the Max marks and min marks together from student table?__

```mysql
Select max (marks) from Student
Union
Select min (marks) from Student
```

__Q how would you retrieve the unique values for the employee_location without using the DISTINCT keyword?__

```mysql
SELECT employee_location 
from employee 
GROUP BY employee_location
```

__Q Write a SQL query to get the third highest salary of an employee from employee_table?__

```mysql
SELECT TOP 1 salary
FROM
(
SELECT TOP 3 salary
FROM employee_table
ORDER BY salary DESC
) emp
ORDER BY salary ASC
```

__Q How can you fetch alternate records from a table?__

You can fetch alternate records i.e both odd and even row numbers. For example- To display even numbers, use the following command:

```mysql
Select studentId 
from student)
where mod(rowno,2)=0
```

Now, to display odd numbers:

```mysql
Select studentId 
from from student
where mod(rowno,2)=1
```

__Q How to create a table without copying data?__

```mysql
create table T1 
as  ( select * from T2 where 1=1 ) -- 1=1 means ignoring where clause
```

__Q Write a query to find the third-highest salary from the EmpPosition table.__

```mysql
SELECT TOP 1 salary
FROM
(
SELECT TOP 3 salary
FROM employee_table
ORDER BY salary DESC
) AS emp
ORDER BY salary ASC;
```

__Q Write SQL query to find max salay in each dept?__

 ```mysql
    SELECT DeptID, MAX(Salary) 
    FROM Employee 
    GROUP BY DeptID;
```

__Q Write an SQL query to clone a new table from another table.__

```mysql
SELECT * INTO WorkerClone FROM Worker WHERE 1 = 0;
```

__Q Write an SQL query to show the last record from a table.__

```mysql
Select * from Worker where WORKER_ID = (SELECT max(WORKER_ID) from Worker);
```

__Q Create an SQL query that shows the TOP 3 authors who sold the most books?__

Let’s say you have two SQL tables: authors and books.The authors dataset has 1M+ rows


| author_name   | book_name   |
| ------------- |-------------|
| author_1      |book_1       |
| author_2      |book_2       |
| author_3      |book_13      |

and The books dataset also has 1M+ rows and here’s the first six:


| book_name   | sold_copies |
| ------------|-------------|
| book_1      |1000         |
| book_2      |1500         |
| book_3      |3400         |

```mysql
SELECT a.author_name, 
       SUM(b.sold_copies) AS sold_sum
FROM author a
JOIN book b
ON b.book_name = a.book_name
GROUP BY a.author_name
ORDER BY sold_sum DESC
LIMIT 3;

```

__Q A table named fruit has the attributes "ID", "Fruit name" and "Basket No":?__

- Find the basket number which have more than 2 fruits.
- Find the basket number which contain orange.
- Find the fruits which are present in more than one basket.

|ID | Fruit Name | Basket No|
|---|------------|----------|
|1  |Apple       |1         |
|2  |Banana      |2         | 
|3  |Orange      |1         |
|1  |Apple       |2         |
|2  |Banana      |3         |
|3  |Orange      |2         |
|4  |Mango       |2         |
|5  |Grapes      |1         |
|1  |Apple       |3         |


find the basket number which have more than 2 fruits.

```mysql
SELECT   basket_no
FROM     baskets
GROUP BY basket_no
HAVING   COUNT(*) > 2
```

find the basket number which contain orange.

```mysql
SELECT DISTINCT basket_no
FROM   baskets
WHERE  fruit_name = 'Orange'
```

Find the fruits which are present in more than one basket.

```mysql
SELECT   fruit_name
FROM     baskets
GROUP BY fruit_name
HAVING   COUNT(*) > 1
```

__Q Consider the below DEPT and EMPLOYEE table and answer the below queries?__

```mysql
DEPT
DEPTNO (NOT NULL , NUMBER(2)),
DNAME (VARCHAR2(14)),
LOC (VARCHAR2(13)

EMPLOYEE
EMPNO (NOT NULL , NUMBER(4)),
ENAME (VARCHAR2(10)),
JOB (VARCHAR2(9)),
MGR (NUMBER(4)),
HIREDATE (DATE),
SAL (NUMBER(7,2)),
COMM (NUMBER(7,2)),
DEPTNO (NUMBER(2))
```
MGR is the EMPno of the Employee whom the Employee reports to.
DEPTNO is a foreign key.

1. List all the Employees who have at least one person reporting to them.

```mysql 
SELECT ENAME FROM EMPLOYEE WHERE EMPNO IN (SELECT MGR FROM EMPLOYEE); 
```

2. List the highest salary paid for each job.

```mysql 
SELECT JOB, MAX(SAL) FROM EMPLOYEE GROUP BY JOB 
```

__Q In which year did most people join the company? Display the year and the number of Employees?__

```mysql
SELECT TO_CHAR(HIREDATE,'YYYY') "YEAR", COUNT(EMPNO) "NO. OF EMPLOYEES"
FROM EMPLOYEE
GROUP BY TO_CHAR(HIREDATE,'YYYY')
HAVING COUNT(EMPNO) = (SELECT MAX(COUNT(EMPNO))
FROM EMPLOYEE
GROUP BY TO_CHAR(HIREDATE,'YYYY'));
```

__Q Write a correlated sub-query to list out the Employees who earn more than the average salary of their department?__
 
```mysql
SELECT ENAME,SAL
FROM EMPLOYEE E
WHERE SAL > (SELECT AVG(SAL)
FROM EMPLOYEE F
WHERE E.DEPTNO = F.DEPTNO);
```

__Q Find the nth maximum salary?__
 
```mysql
SELECT ENAME, SAL
FROM EMPLOYEE A
WHERE &N = (SELECT COUNT (DISTINCT(SAL))
FROM EMPLOYEE B
WHERE A.SAL<=B.SAL);  
```

__Q Select the duplicate records (Records, which are inserted, that already exist) in the EMPLOYEE table?__
 
 ```mysql
SELECT * FROM EMPLOYEE A 
WHERE A.EMPNO IN (SELECT EMPNO                                          
FROM EMPLOYEE                                          
GROUP BY EMPNO                                           
HAVING COUNT(EMPNO)>1)
AND A.ROWID!=MIN (ROWID));
```

__Q Write a query to list the length of service of the Employees (of the form n years and m months)?__
 
```mysql
SELECT ENAME "EMPLOYEE",TO_CHAR(TRUNC(MONTHS_BETWEEN(SYSDATE,HIREDATE)/12))
||' YEARS '|| TO_CHAR(TRUNC(MOD(MONTHS_BETWEEN 
(SYSDATE, HIREDATE),12)))||' MONTHS ' "LENGTH OF SERVICE"
FROM EMPLOYEE;
```